Revit 2024 API
DocumentEntryPoint.SaveAs Method
Overload List
Name | Description
SaveAs()
 Saves the document to a file name obtained from the Revit user without prompting the user to overwrite file if it exists.
 (Inherited from UIDocument.)
SaveAs(UISaveAsOptions)
 Saves the document to a file name obtained from the Revit user optionally prompting the user to overwrite file if it exists.
 (Inherited from UIDocument.)
See Also
DocumentEntryPoint Class
DocumentEntryPoint Members
Autodesk.Revit.UI.Macros Namespace